package stopword;

import java.util.Arrays;
import java.util.Collections;
import java.util.HashSet;
import java.util.List;
import java.util.Set;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

import com.saltlux.tms3.util.UserStopWordPattern;

/**
 * @version $Id$
 */
public class PattenStopWord extends UserStopWordPattern {
	protected static final Set<String> ENGSTOP_SET;
	protected static final String[] stopContain = { "¸¶½Ã", "ÇÑÆí", "³ªÁß", "Æò¼Ò", "°è½Ã", "¿ø·¡", "º»°İÀû", "¹İ°¡", "½¬¿î", "¿À¸¥", "´ëÇ¥Àû",
			"ÀÌ°Å", "µî¿¡", "¼­µµ", "¾îÀÌ", "¹¹³Ä", "ºÙÀÌ", "ÀÌ»óÇÏ", "¾îµô", "¹ºµ¥", "ºÎÅÍ", "¹«°Å", "¼¼¿ì", "±¸Ã¼Àû", "¸¸Áö", "°¡¸®Å°", "¾²Áö", "µµ·Ï",
			"»ì¸®", "¹ß·Î", "¼­¿î", "¹æ_¼Û", "¹»±î", "¾Ê°Ú", "°á±¹", "Ã³·³", "ÇØ¶ó", "·¸°Ô", "¿Í¿ä", "Ç®¸®", "º¸³¾", "¸®°í", "¹ÌÄ£", "³ª¸§´ë·Î", "³¡_Å¸ÀÌÆ²",
			"º¸ÀÏ", "¸Å´Ş", "ÁöÄ£", "ÁÖ½Ç", "ºĞµµ", "·Î¸¸", "¹Ù¶óº¸°í", "±Í¿¡", "±¸³ª", "°¡¹ö", "½º½º·Î", "³ë¸®", "±¸ÇØ", "±×·¯³Ä", "³¢¾î", "°¢±¹", "Áö¼ÓÀû",
			"¾î¸®", "´©±ºÁö", "ÇÇ¿ì", "¶ó´Ï", "°Å±¸", "¼Ò¸±", "ÀÚÀÚ", "±×¶©", "Á¶±İ", "ÈÇ¸¢", "¹°·Ğ", "ÀÎ±Ù", "¾Ö½á", "±àÁ¤Àû", "ÀüÃ¼Àû", "Ä¡¿ì", "±î¿î",
			"ÀÚ¸£", "ÀÎ»óÀû", "¾î·ÆÁö", "¿øÀÇ", "´ÙÀ½ÁÖ", "¹¹·¡", "ÀÌ·ç¾îÁö", "±×ÂÊ", "±¸¿ö", "ÇØÁÖ", "°¡°Ô", "³ª¿À", "ÁßÀÎ", "ÁË¼Û", "ÀÚÁÖ", "º¸³½", "¸ğ¾Æ",
			"¹Ğ¾î", "¿ì¼±", "¸»¸®", "µÑÂ°", "Ã¹¹øÂ°", "ÀÌ¸¥", "¾îµÎ", "¾ğÁ¨", "ÇÑÂü", "Áö¾î", "¾Ö½á", "¼ø½Ä°£", "Ã¹Â°", "¾îµø¾î", "ÀüÃ¼Àû", "¼¼¹øÂ°", "È¿°úÀû",
			"¾ÈÅ¸±î¿î", "ÁÖ½Ã±â", "±×·¸", "¸»ÀÚ", "ÀÌµ¿ÇÏ", "¾î·ÆÁö", "¾²½Ã", "³²Áö", "¸¹Àİ", "±×·¯", "null", "Àü±¹Àû", "Á÷Á¢Àû", "Àü¹İÀû", "±Ùº»Àû", "¾îµò",
			"¾ó¸¶Àü", "Ä¡¸íÀû", "ÀÌÇÑÅ×", "ÀÏ¹æÀû", "È£È£", "¹¹ÁÒ", "¾î¶®¾î", "À»±î", "°áÁ¤Àû", "´©±¸³Ä", "Æò»ó½Ã", "°¢Áö", "¶»°Ô", "¾ÆÆÄ¿ä", "ÇÑ¹øÂë", "ÇÑ¼û_½¬",
			"Àß³­", "°í°³_¼÷ÀÌ", "¿­Á¤Àû", "»óÇÑ", "¾Ê³Ä", "ÁıÁßÀû", "»ó´ç¼ö", "¾Ê´õ", "´ë´ëÀû", "¾î¶°³Ä", "ÁÙ_¾Ë", "À§ÂÊ", "¹ÌÃÆ¾î", "ºĞÀ§", "ÀÌ¸¾¶§", "È¿À²Àû",
			"¿©·µ", "ÇÑ¸í¾¿", "¾Ê¾ÒÀ¸", "¾îµòÁö", "Á¶_¿¬", "µå¸±_¸»¾¸", "¾ÆÆÛ", "°Å½½·¯", "ÆÄ°İÀû", "Çì¾îÁø", "¸»¾¸µå¸±", "¾ÊÀİ", "¿Ê_ÀÔ°í", "¿¹Àü¿£", "¼Õ_Èçµé",
			"µÆ½À", "°¡½¿¼Ó", "´Ù½ÃÇÇ", "¾²½Å", "¾ê±äµ¥", "´«_°¨", "µÎ¼¼", "ÂÌ±ê", "¾Æ´Õ", "´©°¡", "´©±¸", "¾ú´Ù", "ÇÏÀİ", "ÅÙµ¥", "¼Ì¾î", "ÀÔ¾î", "°Ú¾î",
			"ÁÒÀ×", "´Ï±î", "°å¾î", "À¸½Ç", "Á³¾î", "´Ù°í¿ä", "¾ÒÀ»", "À»¶§", "Á³À»", "ÀÖÀ»", "¾øÀ»", "¿ï¸®ÀÚ", "ÀÚ¸¶ÀÚ", "³»¸®ÀÚ", "»ç°Ü", "°ÙÁö",
			"¾ø[°Ú°Ù]", "¾ø½¿", "¹È", "¿´À¸", "´Â°Ü", "¸¦¶§", "¹¹", "¿ª»ç»ó", "¾î¶®", "º¼·¡", "µÑ¾¿", "µµµµ_", "Áá", "ÄÑ", "¼Ì", "ÀÇ±â¾ç¾ç", "ÁÖ·Î",
			"ÈçÈ÷", "¸ğ½À_º¸°í", "µåµğ", "°Ú³×", "±×»õ", "¿äÁò¿£", "½º·¹_", "°ÍÀÎÁö", "_°íÇÁ", "¾Ê", "ÀûÀÎ°Å", "ÀûÀÎ¸é", "ÇØ¼­", "°ÍÀ¸", "°¡±î½º", "ÇûÀ½",
			"¿¡°Ô", "¾ø½À", "¾ú", "¾øÀ¸", "´Ù±¸", "½Åµ¥", "ºÎºÖ´Ï", "À¸¼Ì", "ÀÌ³×", "±×°Å", "¾ó¸¶", "¸»·Ğ", "Á³", "±×°Å", "¾ó¸¶", "¸»·Ğ", "Á³", "·Á³ª",
			"title", "Ä¿¼­", "ÆÛÁö", "¹«ÀÛÁ¤", "±âÅ¸Ä¡", "º¸¶õµí", "ÀÌÂÊ", "·Î_»ç", "³»¼­", "ÅÀ°Å", "±­°´", "½Í", "ÇÒ¼ö", "ÇÑÂÊ", "ÇÏ¿´" };

	// StopPattern
	protected static final String[] stopPattern = { ".+_[0-9]+", "[0-9]+.$", ".[0-9]+", "[0-9]+[.][0-9]+", ".*[^_]¼­°¡",
			".*[^½Ê]ÀÚ°¡_.*", ".*[^_È£]¼ö°¡([_].*)?", ".*[^_ÄÉ°íµ¥·çÅ¸Æ¼¶óºñ¼Òºü¸µÆÄ¹ÙÀÌÄí°¼°ú¹ÌÇÇº£·ÎÆä¸£»²½î±î±ñ¿¡]³Ä.*", ".*[^_Ä«»ş]¸¦(_.*)?",
			".*[^½Ê]ÀÚ°¡_.*", ".*[^_]¼ö°¡([_].*)?", "^[ÇÕÇùµ·°áÈ¸]ÀÇ_.*", ".*[^ÀÔ½Ç]Àû$", ".*..ºÎ°¡.*", ".*[°¡µÎÄ¡Áö¸£]¸é_.*",
			".*_[a-z][0-9]\\+", ".*_µ¹¸®[^±â].*", ".*_³ª°¡[^³ë].*", "[0-9]_.*", ".*_[0-9]+$", ".*´ÂÁö.*", ".*½Ê½Ã[^ÀÏ_].*",
			".*½Ê½Ã[^ÀÏ_].*", ".*[^Èï]º¸³×", ".*\\/.*", ".*[0-9]¸íÀÇ", ".*[^Åõ]ÀÚ°¡", ".*[^a-z0-9][0-9]", ".*[0-9]ºĞ°£.*Àß¸ø",
			".*[^Åõ]ÀÚ°¡ (ÅõÀÚ°¡)", ".*Æ´_.*Ã¼°ü±¤°´", ".*[^ÇÇ]°Ü", "È¸¸».*°ø°İ", "È¸ÃÊ.*°ø°İ", "¾ß±¸´Ü_.*_°ø°İ", "[0-9]È¸_°ø°İ", "[0-9]+³â_¹ß°ß",
			".*[0-9]°³±³", "[0-9]+³â.*°³±³", "[0-9]+°³_°í±³", "[0-9]+³â°£_°í±³", "[0-9]Â÷ºñ±³", ".*[0-9][°³¹İ]_ÇĞ±³", "±³¼ö.*´ëÇĞ±³",
			"[0-9]+³â_..´ëÇĞ±³", "[0-9]+³â_....´ëÇĞ±³", "[0-9]+°³_°íµîÇĞ±³", "[0-9]+È¸_¿ì½ÂÇĞ±³", ".*[-.].$", ".*[%].+[%]", "Àü¹®°¡_...",
			"[0-9]È¸_ÀÌ¿ë±Ô", "[0-9]+È¸_ÀÌÁ¤±Ô", "[0-9]+°÷_·¹Áö¿À³Ú¶ó±Õ", "¾À[0-9]+Á¤¼ö¹Î³×_°¨±Ö", "[0-9]+°³_±â°ü", "¾À\\d+_",
			"[^a-z0-9]+[0-9][0-9]", ".+[0-9]´ë°¡", ".+[^_]´ë°¡", "¼·¾¾.+[0-9]+µµ°¡", "...+µµ°¡", "..·¹°¡", ".+[^Çè]_¼ö°¡",
			".+[0-9]½Ã°¡", "^[a-z]+ed$", "^[a-z]+ing$", "^[a-z]+ily$", "¢¥", "¡±", "¡İ", "¡½", "^d_", "¢â", "=", "^\\d[A-Z]$",
			"^[°¡-Èş]+[A-Z|a-z]$", "^[°¡-Èş] [°¡-Èş]$", "\\?", };

	// ¾î¹Ì => StopPostfix
	protected static final String[] stopPostfix = { "0°³", "1°³", "2°³", "3°³", "4°³", "5°³", "6°³", "7°³", "8°³", "9°³", "Àİ",
			"°¬", "°Ú", "¹×", "#", "\\$", "%", "&", "\\*", "=", "@", "©÷", "¡¤", "¥á", "\\?", "¡¦", "¡Ç", "¥¡", "¥¢", "\\?", "¡­",
			"¨ç", "¨è", "¨é", "¨ê", "¨ë", "¡á", "¡à", "¢º", "¡Û", "¡Ú", "\\?", "¢Ü", "¢İ", "¡µ", "¡¶", "¡·", "¡¸", "¡¹", "¡»", "ª¤", "ª«",
			"ª­", "ª¯", "ª»", "ª¿", "ªÃ", "ªÆ", "ªÇ", "ªÍ", "ªÎ", "ªÏ", "ªé", "ªê", "ªë", "ªò", "ªó", "«¬", "«º", "«½", "«Ä", "«Æ", "«È",
			"«É", "«Ë", "«Ğ", "«â", "«ä", "«ê", "«ë", "«ì", "\\?", "¤¤", "¤§", "¤²", "¤·", "¤¾", "¤À", "§¸", "§®", "§°", "§³", "§´", "§©",
			"§Ò", "§µ", "°¬", "Âú", "±½", "±¾", "°Î", "°È", "°Ù", "°Ú", "²¯", "²°", "±Ü", "±í", "²¼", "ˆ", "µ×", "µø", "¶£", "¶¤", "¶¸",
			"¶¹", "¶Å", "‹ó", "¶»", "¶Ô", "¶Õ", "¶Ù", "¶Ú", "¶Û", "¶î", "³Ä", "Âë", "Ã£", "ÃÆ", "Çû", "_dna", "_g20", "_ins", "_°¡¸®Å°",
			"_°íÀº´Ô", "_³öµÎ°í", "_´ÙÀ½ÁÖ", "_´ë¹®¾Õ", "_´ëÇ¥Àû", "_µÎ»ç¶÷", "_¹®Á¦µé", "_¹«Á¶°Ç", "_»çÈêÂ°", "_»ó´ç¼ö", "_¼¼°èÀû", "_¼¼¹øÂ°", "_½º½º·Î",
			"_½Ã°£´ç", "_¾îµø¾î", "_¿©ÀÚºĞ", "_¿ª»ç»ó", "_ÀÖÀ¸½Å", "_ÃÖ¿¬¼Ò", "_ÃÖ¿ì¼ö", "_Æ¯¼º»ó", "_ÇÏ³ª·Î", "_ÇÏÁö¸¶", "_ÇØÁÖ½Ã", "Àü¹®°¡µé", "¸Å·ÂÀû",
			"¸ğ_±º", "¹æ_¹®", "º¹_ÀÔ", "ºÎ·´Áö", "ºñ_³¡", "ºñ±³Àû", "»ì_ÃÖ", "»óÇÏ³×", "¼Å¾ßÁÒ", "¼Å¾ßÁö", "¼Õ_Àâ", "½À´Ï²¨", "½À´Ï´õ", "½Ã²ô·¯", "½Ç_¹®",
			"¾¾ºÎÅÍ", "¿Ê_ÀÔ", "ÀÇ_²Ş", "ÀÇ_´«", "ÀÇ_¼Õ", "ÀÇ_Áı", "ÀÌ_Áı", "ÀÌµğ¾î", "ÀÌ¶Ù±â", "ÀÌ¶ó±â", "ÀÌ¶ó´¢", "ÀÌ·±½Ä", "ÀÌ»ó¾¿", "ÀÌ»óÀº", "ÀÌ»óÀÎ",
			"ÀÎ_ÁÙ", "ÀÏ_¹ã", "ÀÔ´Ï´õ", "°¡°¡_", "_ÀÚÃ¼", "_Á¤µµ", "&gt", "_pan", "_ceo", "¾î°¡", "¿¹°¡", "....ÀÎ°¡", "Ã¤°¡", "Ã³°¡", "Ä«°¡",
			"ÆĞ°¡", "ÇÁ°¡", "È£°¡", "_¿ì½ÂÀÚÀÎ", "_ÀÌ³»°¡", "_Á¤µµ_°¡¸é", "_À­¸ö", "_Á¤", "°£ÀÇ", "Â¥¸®", "_ÀÚ¶ó", "_½Ã´ëÀÎ", "_Ãâ¿¬ÀÚºĞµµ", "_°è½Ã", "_±è",
			"_°¡±îÀÌ", "_¸ğ¾Æ", "_¾Æ", "_¿Ö", "_Á¤µµ_³·", "_³»·È½À", "_ÇÑµ¥", "_»ç", "_¼±¹°_»ç", "_ÁÂ¿ì", "_Ãà", "_¿øÀÇ", "_¿øÀÌ", "_fm",
			"_±â³ä½ÄÀÌ_½ÃÀÛ", "_Æ¯", "_ÁîÀ½", "_½Ã", "_ÇÑ¸í¾¿", "ÁßÀÇ", "_°­", "¹æ¼ö±âÆ´", "_»óÅ­", "_Â÷", "_Àı´ë", "_Àı´ë_ÆÈ", "_ÆÄ´ÏÆÄ", "_°¨µ¿Àû",
			"_Äİ", "_¼Ó", "_Àü¹®°¡°¡", "Àç³­À¸", "_Áö³»", "_Áö´ë", "_ÁøÁö", "_Â¥Áõ", "_ÂªÀº", "_Ã³·³", "_Ã³À½", "_ÇÇ°ï", "_ÇÇ»ì", "_ÇÇÅÍ", "_ÇÇÇÏ",
			"_ÇØÁÖ", "°¡_´«", "°¡_Áı", "°¨°¢Àû", "°í_³î", "°í±âµé", "°úÇĞÀû", "±×·¨¾î", "±×·¯°Ô", "±×·±µ¥", "±â_Èû", "±æ_¿ø", "³ªÈêÂ°", "³×_Áı", "´Â°Çµ¥",
			"´Â°ÇÁö", "´Â¸ğ½À", "´Ï´Ù¸¶", "´Ô_´ì", "´Ù°¡¿À", "´Ù°¡¿Â", "´å»õÂ°", "µÎ¹øÂ°", "µğ_°¡", "·Î_¿Ã", "¸£¸£¸£", "¸®_Àâ", "¸®_Áı", "¸¶µğ¾¿", "¸·_³¯",
			"¸»ÀÏ¼¼", "¸ğ°¡", "¹«°¡", "¹Ì°¡", "¹è°¡", "º¸°¡", "»ç°¡", "¼¼°¡", "½Å°¡", "¿¡°ü", "ÀâÈü", "ÁıÈü", "ÀĞÈü", "ÀÍÈü", "¾öÈü", "¾ÃÈü", "½ÄÈü",
			"»çÈü", "¸·Èü", "¸ÂÈü", "¸ÎÈü", "¸ÔÈü", "¹¯Èü", "¹àÈü", "¹âÈü", "»çÈü", "È÷È÷", "ÇÊÈ÷", "ÇàÈ÷", "ÆòÈ÷", "Ç¥È÷", "Ç¬È÷", "ÆÇÈ÷", "ÆİÈ÷", "ÆØÈ÷",
			"Æ¶È÷", "Æ¼È÷", "Æ´È÷", "Æ¯È÷", "ÅºÈ÷", "ÄíÈ÷", "ÄèÈ÷", "Ä§È÷", "Ä«È÷", "ÃşÈ÷", "ÃµÈ÷", "ÂüÈ÷", "Ã³È÷", "ÂùÈ÷", "ÂøÈ÷", "Â÷È÷", "ÂóÈ÷", "ÂïÈ÷",
			"ÂâÈ÷", "¼ÖÁ÷È÷", "ÀÚÁïÈ÷", "Ä«ÁîÈ÷", "ÁøÁßÈ÷", "¿­ÁßÈ÷", "½ÉÁßÈ÷", "½ÅÁßÈ÷", "±ÍÁßÈ÷", "»¹ÁÜÈ÷", "ÁÙÁÙÈ÷", "ÁØÈ÷", "ÁÖÈ÷", "ÁÔÈ÷", "ÁÇÈ÷", "Á·È÷",
			"Á¥È÷", "Á·È÷", "Á¶È÷", "Á¯È÷", "Á¦È÷", "Á¥È÷", "Á¤È÷", "Á£È÷", "ÀüÈ÷", "ÀåÈ÷", "ÀâÈ÷", "ÀİÈ÷", "ÀÛÈ÷", "ÀÚÈ÷", "ÀØÈ÷", "ÀÔÈ÷", "ÀÏÈ÷", "ÀÎÈ÷",
			"ÀÌÈ÷", "¿ëÈ÷", "¿äÈ÷", "¿¬È÷", "¿©È÷", "¾öÈ÷", "¾ôÈ÷", "¾ñÈ÷", "¾îÈ÷", "¾çÈ÷", "¾ßÈ÷", "¾ÕÈ÷", "¾ËÈ÷", "¾ÉÈ÷", "¾ÈÈ÷", "¾ÇÈ÷", "¾¡È÷", "½òÈ÷",
			"½âÈ÷", "½ÒÈ÷", "½ÎÈ÷", "½ÉÈ÷", "½ÇÈ÷", "½ÅÈ÷", "½ÅÈ÷", "½ÄÈ÷", "¹ø_½ÃÈ÷", "½¿È÷", "½½È÷", "½ºÈ÷", "¼øÈ÷", "¼÷È÷", "¼öÈ÷", "¼ÓÈ÷", "¼ÒÈ÷",
			"¼¼È÷", "¼ºÈ÷", "¼­È÷", "»öÈ÷", "»óÈ÷", "¹«»çÈ÷", "¸¶»çÈ÷", "±Ù»çÈ÷", "»ÓÈ÷", "–jÈ÷", "»ÌÈ÷", "»»È÷", "»§È÷", "»¥È÷", "ºşÈ÷", "ºÙÈ÷", "ºØÈ÷",
			"ºÓÈ÷", "ºĞÈ÷", "º°È÷", "¹àÈ÷", "¹ÚÈ÷", "¹ŞÈ÷", "¹ßÈ÷", "¹ÚÈ÷", "¹ĞÈ÷", "¹ÎÈ÷", "¹ºÈ÷", "¹·È÷", "¹·È÷", "¹µÈ÷", "¹¯È÷", "¹¦È÷", "¹«È÷", "¹¡È÷",
			"¸øÈ÷", "¸ôÈ÷", "¸ğÈ÷", "¸íÈ÷", "¸íÈ÷", "¸ÛÈ÷", "¸ÔÈ÷", "¸ÍÈ÷", "¸ÆÈ÷", "¸¸È÷", "¸¹È÷", "¸»È÷", "¸°È÷", "¸·È÷", "·ÃÈ÷", "·ÄÈ÷", "·ÇÈ÷", "·ÊÈ÷",
			"·±È÷", "µúÈ÷", "µæÈ÷", "µ¹È÷", "µ·È÷", "µ¶È÷", "µµÈ÷", "µªÈ÷", "¸ØÈ÷", "´øÈ÷", "´ëÈ÷", "´èÈ÷", "´çÈ÷", "´ãÈ÷", "´İÈ÷", "´ŞÈ÷", "´İÈ÷", "´ÃÈ÷",
			"‡¶È÷", "´¯È÷", "³çÈ÷", "³äÈ÷", "³ĞÈ÷", "³×È÷", "³ËÈ÷", "³¹È÷", "³¶È÷", "³´È÷", "³¯È÷", "³ª¶ó", "³ªÆÄ", "³ªÈ÷", "²ÅÈ÷", "²öÈ÷", "²ûÈ÷", "²ıÈ÷",
			"²ÅÈ÷", "²ÄÈ÷", "²¨È÷", "±ñÈ÷", "±îÈ÷", "±íÈ÷", "±èÈ÷", "±æÈ÷", "±ßÈ÷", "±ŞÈ÷", "±İÈ÷", "±ÙÈ÷", "±ÁÈ÷", "±»È÷", "±³È÷", "±²È÷", "±¦È÷", "°øÈ÷",
			"°÷È÷", "°õÈ÷", "°ïÈ÷", "°îÈ÷", "°íÈ÷", "°ãÈ÷", "°¨È÷", "°£È÷", "°¡È÷", "_È÷", "Èó", "Èò", "ÀúÈñ", "ÀÌÈñÄ§Ç¥", "±İ±×", "±â±×", "³ª±×", "³Ê±×",
			"³×±×", "³î±×", "³ò±×", "³õ±×", "´©±×", "´À±×", "´Â±×", "³Î°ø", "km_»ó°ø", "¹ÌÅÍ_»ó°ø", "°³_¼º°ø", "³â_¼º°ø", "¸í_¼º°ø", "¹ø_¼º°ø", "È¸_¼º°ø",
			"³â_¿Ï°ø", "¿ù_¿Ï°ø", "_ÀÎ°ø", "°ø°ú", "±³°ú", "±İ°ú", "´Ü°ú", "µî°ú", "¹æ°ú", "¹ı°ú", "»ê°ú", "½Ç°ú", "Àå°ú", "ÁÖ_Àü°ú", "³â_Àü°ú", "¿ù_Àü°ú",
			"º¸ÀÌ", "½À´Ï", "¾Ò¾î", "ÇÑ¹ø", "_fs", "_sk", "_ts", "_vs", "_µî¿¡", "_Àü±¹", "int", "vcr", "»ç½Ç»ó", "¸¶Áö¸·", "_´Ù·ç", "_´ë±¸",
			"_µÎ°³", "_µå¸®", "_µî°ú", "_¸ÀÀÖ", "_¹ºÁö", "_¹Ú¿µ", "_¹ÚÃ¶", "_¹ßÀÌ", "_¹ö¸®", "_º¸°ï", "_º»°İ", "_ºÎ½Ã", "_ºÓÀº", "_»¡°£", "_ºü¸¥",
			"_»ç½Ã", "_»õµé", "_¼®Çö", "_¼Ò¿µ", "_¾¾³×", "_¾¾ÀÎ", "_¾Æ³ª", "_¾Æ½¬", "_¾Æ½Ã", "_¾ÆÁÖ", "_¾ÊÀ¸", "_¾Ë¸®", "_¾çÀÇ", "_¾ê±ä", "_¾ê±æ",
			"_¿¡¹Ì", "_¿µ¼÷", "_¿¾³¯", "_¿À¿°", "_¿À½Ã", "_¿Àºê", "_¿Àº¹", "_¿À¶û", "_¿À¶ó", "_¿ï¸®", "_À§´ë", "_À±Á¤", "_À±ÁÖ", "_À±Èñ", "_ÀºÁÖ",
			"_À¾³»", "_ÀÇ¾Æ", "_ÀÌ³»", "_ÀÏ´Ü", "_ÀÓ¸¶", "_Àá±ñ", "_Àá½Ã", "_Àû±Ø", "_Ãµ¸¸", "_ÁÜÀÎ", "_ÃÊ°ú", "_Çª¸¥", "_ÇÑÂÊ", "_ÇÑÅ×", "_ÇØ´ç",
			"_Çö¿ì", "_Èçµé", "µ¿_Áı", "¹«´õ±â", "¹Ù¶óÁö", "º¸´Ùµµ", "»çÀåÀÌ", "Ä¡_º¸", "È¸_³¡", "Á³", "¿Ô", "ÀÖ", "½º·±", "·¯¿î", "¸³´Ï", "°Ì´Ï", "Áı´Ï",
			"°©´Ï", "Áİ´Ï", "½Ê´Ï", "³À´Ï", "º¾´Ï", "ÃÆ¾î", "Ä×¾î", "¸Ô¾î", "¶ú¾î", "·¶¾î", "Àä¾î", "ºÃ¾î", "Çû¾î", "°Î¾î", "ÀÖ¾î", "·¨¾î", "¿´¾î", "³ù¾î",
			"¿ï¸®", "¿À½Ã", "Æ¯ÀÌ", "´Ü¼ø", "ÀÌ¸®", "ÇÇÇÏ", "´çÀå", "ÀúÂÊ", "´Ş·¡", "¾Æ¿ì", "¿À±â", "¼ÖÁ÷", "¸ÔÁö", "´ë°í", "°³°¡", "ÀÇ¿Ü", "Àá½Ã", "´ÙÇà",
			"ÃÖ¼±", "ºñ°¡", "´ëÃ¼", "¸»·Î", "È®½Ç", "ÁÖÀú", "´«¾Õ", "ÁÖ¹«", "ÇÊ¼ö", "Æ°Æ°", "Ã¢ÇÇ", "¼ö½Ê", "Áö°Ô", "½É½É", "´Ü´Ü", "¿ì¾Æ", "Á¶Â÷", "Çû½À",
			"¶§", "¾Ò", "ÀÚ±¸", "°Å¾ß", "Á®¾ß", "°¡¾ß", "À¸·Î", "¸î°µ", "¹é°µ", "¿­°µ", "Âî°µ", "ÀÌ°Í", "ÀÎ°Í", "ÀÏ°Í", "ÁØ°Í", "ÁÙ°Í", "Áø°Í", "Áú°Í",
			"Ä£°Í", "ÇÒ°Í", "Èù°Í", "Èú°Í", "°Å°Ü", "µé°Ü", "´É°Ü", "´Ï°Ü", "´ã°Ü", "´ó°Ü", "µÑ°Ü", "µî°Ü", "¶â°Ü", "ÁöÇÏÃ¶_sk_½Â°´", "±¸Á¶´ë°¡_½Â°´",
			"¼ø°£_½Â°´", "½Ã°£_½Â°´", "½º·´°Ô_½Â°´", "Æ¯°ø´ëÀå°ú_½Â°´", "¸é¼¼Á¡_ÃâÀÔ±¸_½Â°´", "¸ñÁ¹¶ó_½Â°´", "¸í_½Â°´", "¿¹Àü", "ºË", "ºË°Ô", "vÁú", "´Ù¸§", "´ìÀ¸·ç",
			"¸»µè", "°Ô", "À»¾ò", "À»ÁØ", "¹Ù±ù", "Çô", "À¸", "ºÃÀÚ", "´ëÅë", "[0-9]¸í", "ÀÎÁÙ", "ÇÔ¿¡", "À¸", "°Ú±¸", "ÈşÈş", "È÷Èş", "º¸Èş", "ÀâÆL",
			"ÈıÈı", "ÀâÈü", "Èü", "°ğ", "°ö", "°÷", "°í°ø", "³ª°£", "³â°£", "´Ş°£", "´Ù°£", "´ç°£", "µå°£", "µç°£", "µé°£", "¶§°£", "³ª¶ó°£", "Ä³·¯°£",
			"¼¼·Â°£", "·Î°£", "±×·ì°£", "´ë·ú°£", "µµ¸Á°£", "¸ø°£", "ÀÎ¹°°£", "ÇÑ¹°°£", "ºÏ¹Ì°£", "ÇÑ¹Ì°£", "³²ºÏ°£", "°¥ºñ¾¾", "°¥Åß", "°¨¼Ò¼¼°¡", "°©½Ã´õ",
			"°«_´ëÇĞ", "°¬¾î¿¹", "°­_¹®", "°­_º¯È£»ç", "°­°£È£»ç", "°­±³°ü´Ô", "°­¼®±¸ÀÇ", "°­¼­±¸¿Í", "ÈşÈş", "°¡ÁøÀÚ°¡", "°¢³³´Ï", "°¥°ÅÀ¯", "°¥°Ü´Ï", "°¡¼ö´Ô",
			"°¡½¿_µû¶æ", "°¡½¿_¼Õ", "°¡À½", "°¡º±´õ", "°¡ºÁ¾ß", "¾¾¿¡", "¾È³ç", "¾Öµé", "¾îÁú", "¿´´ø", "ÀÌ°¡", "ÀÌ°í", "ÀÌ³ª", "ÀÌ¶û", "ÁøÂ¥", "ÃøÀº",
			"Çß½À", "Á¾·ù", "Àß¸ø", "À§·Î", "»ı±â", "_È¿", "_¶û", "_³­", "_³²", "_³ë", "_¸¶", "_¸î", "_¸ğ", "_¹Ì", "°í¿ä", "³ª¾¿", "³¢¸®", "°Ú½À",
			"´©°¡", "´Âµ¥", "´Ù¿î", "_´öºĞ", "¶ó±¸", "¸»ÀÌ", "¾îÀ¯", "_¿À", "_ÀÏ½Ã", "¾ø", "»ıÅÂ°è°¡_ÆÄ±«", "¹è_°í±³", "ÇĞ°ú±³", "ÇĞ±³±³", "´Â±³", "´É±³",
			"¸Â±³", "¶§_ÇĞ±³", "¿ì¸®_ÇĞ±³", "_int", "_Çö±Ô", "_Çü±Ô", "_È£±Ô", "±×±×", "±â°¡", "±è°¡", "³ë°¡", "À§·Î", "»ı±â", "¸¸³²ÀÇ±¤", "ÄôÄç",
			"ÀÏ°¡°ß", "0°³", "1°³", "2°³", "3°³", "4°³", "5°³", "6°³", "7°³", "8°³", "9°³", "\\+", "´ëÇØ", "¿¹Á¤ÀÓ", "´ëÇÏ", "ÃßÈÄ", "µ¿¾È",
			"_m", "_p", "°³¾¿", "ºĞÀ§", "¿À¸¥", "_Àç", "_À§", "_´Ù", "_c", "¡æ", "\\-", "_ÇÔ", "_a", "_k", "_r", "_f", "_È­", "_s",
			"_¿Ï", "_q", "_À§", "_b", "_°Ç", "_¸ñ", "_°Í", "_Àü", "_ÀÓ", "_r", "_ÇÒ", "_t", "_n", "_d", "_h", "_b", "_l", "_a",
			"_x", "_¿Ü", "_¼öÁØ", "_and", "_needed", "_is", "_¿ä", "_»Ó", "_o", "_ÃÖ", "_w", "_¿Ï", "_¿¡", "_ºñ", "_°Í", "_Çö",
			"_d", "_e", "¡¯s", "¡±", "ªÈ", "`", "¡¯", "enabled", "_i", "ªË", "¡¯s", "_¹İ", "¿¡µµ", "_ÀÌ¿Ü", "°³", "°³¿ù", "°Ç", "°úÁ¦",
			"³â", "³â°£", "°³¿ù°£", "°¡Áö", "³â´ë", "³âÂ÷", "´ë", "¸í", "¹é¸¸¿ø", "ºĞ", "¼¼±â", "¼¼ºÎ", "¼¼ºÎ°úÁ¦", "¼¼ºÎ°úÁ¦¸í", "½Ã°£", "¾ï¿ø", "¿ø",
			"¿ù", "ÀÏ", "Á¶¿ø", "Á¾", "Â÷³â", "Â÷³âµµ", "Â÷Àû", "Ãµ¿ø", "¾ï", "Ãµ¸¸", "Ãµ¸¸¿ø", "³âµµ" };

	// ½ÃÀÛ => StopPrefix
	protected static final String[] stopPrefix = { "_", "!", "\\\\", "\"", "#", "\\$", "%", "&", "'", "\\(", "\\)",
			"\\*", "\\+", ",", "-", "\\.", "\\/", ":", ";", "<", "=", ">", "\\?", "@", "\\[", "\\]", "\\^", "`", "\\{",
			"\\|", "\\}", "~", "³­_", "¿À_", "ÆÛ_", "µµÀÇ_", "¿¡°Ô_", "Á¦°¡_", "¾ÆÁÖ_", "int_", "»óÃ¶_", "¾î¾ğ_", "¾îÁø_", "ÀÖ", "ÀÚ_",
			"ÀÚ°¡_", "¾Æµé_", "¾Æ¸§´Ù¿î_", "¾Æ¹«", "¾ÆÁÖ_", "s_", "³â_", "ÈÄ_", "w_°³¹ß", "Çâ_¸ğµ¨", "½Ã_", "Â÷_", "t_´ÜÃà", "Â÷_", "¡Í", "¡Ë",
			"¡°", "ÀÇÇØ_", "¿ë_", "°³_", "µ¿_", "¾ï_", "ÀÏ_", "¿ù_", "À§_", "¹è_", "¸¸_", "¸í_", "ÁÖ_", "·Ã_", "±Ç_", "ÇÒ_", "´ë_", "ÀÌ_",
			"±â_", "¼ö_", "¿Ã_", "µ¥_", "ÀÌ_", "ÅÍ_", "·Î_", "°¡_", "Å¸_", "°Ô_", "¶§_", "À§_", "¾à_", "°³_", "Çâ_", "¹ø_", "Á¾_", "´ë_",
			"¿©_", "°Ç_", "ÁÖ_", "q_", "d_", "w_", "o_", "a_", "b_", "c_", "d_", "f_", "È­_", "ÀÎ_", "±Ş_", "¼ö_", "Çü_", "À²_",
			"°­_", "·Î_", "Çö_", "°Í_", "°£_", "½Ä_", "Á¾_", "Ãş_", "Àü_", "°¢Á¾_", "°æ¿ì_", "ÀÌ¸ç", "°¡°¡_", "°¡Áø_", "°¢°¢_", "°£ÀÇ_",
			"´ëÇÏ¿©_", "´ëÇÑ_", "µµ°¡_", "µµÀÔ_", "¸®¶ó_", "¼­µµ_", "¼ºÀº_", "¼ºÀÇ_", "¿¡°Ô_", "¿¡µµ_", "¿ëÀÌ_", "ÀÇÇØ_", "ÀÌ°í_", "ÇÏ±â_", "º»¿¬±¸",
			"°æ¿ì", "ºÎÅÍ", "¾Ê" };

	protected static final String[] stopSegment = { "test_bg_test", "bg_test", "test_bg", "bg", "bs", "cd", "ct", "cu",
			"de", "di", "", "when", "been", "that", "using", "have", "had", "just", "most", "loading", "tal", "run",
			"within", "try", "possible", "done", "up", "what", "non", "must", "arrange", "too", "such", "ask", "find",
			"through", "submit", "going", "pending", "was", "were", "be", "mainly", "who", "its", "cannot", "without",
			"including", "aging", "his", "ÇùÀÇÈÄ", "able", "ÀÇÇØ", "hope", "refer", "trans", "found", "him", "iii", "don",
			"planning", "latest", "why", "initial", "days", "Å°·Î_ÇùÀÇ", "electrical", "far", "soldering", "ÁøÇàÁßÀÓ",
			"recommend", "directly", "looking", "sure", "while", "worst", "¿Ï·áÈÄ", "continue", "include", "maybe",
			"coming", "those", "several", "waiting", "focusing", "saving", "asking", "plating", "industrial", "almost",
			"having", "previous", "recently", "except", "large", "making", "means", "½Ã_", "always", "biggest",
			"considering", "moving", "internally", "µîµî", "´ëÇØ¼±", "°ËÅäÅ°·Î", "require", "interesting", "°¡´É¼ºµµ", "µå¸®", "°üÇØ",
			"À§ÀÇ", "°æÀï»çÀÎ", "¹Ş±â·Î", "though", "likely", "¼öÀ²ÀÌ", "debugging", "responsible", "immediately", "°Å·¡¼±ÀÌ", "eng",
			"based", "fs", "kg", "kg±Ş", "m", "na", "ooo", "op", "°¡", "°¡°¡", "°¡±îÀÌ", "°¡µÎ", "°¡·®", "°¡¸®", "°¡ÀÇ", "°¡ÀÌ", "°¢°¢",
			"°­Àü", "°®°¡Áö", "°³ÀÎÀû", "°Ç³Ê", "°Ç³Ê¿Â", "°È¾î", "°ËÀº", "°İ·ÄÇÑ", "°í", "°íÀå³­", "°ø°İÀû", "°ü°èÀÚ°¡", "±¸", "±¹Á¦Àû", "±º»çÀû", "±âÅÂ",
			"±è±â", "±è¸ğ", "±è¸ğ¾¾", "±ò±ò", "³ª¾¾", "³ª¿Í", "³ªÇÑÅÙ", "³ªÈ¦·Î", "³²Áş", "³»³ö", "³»¿Ü°æ°ú", "³»¿Ü°æ¹×", "³â", "³â»ı", "³â¿ùµåÄÅ", "³âÂ°",
			"³âÂ÷", "´©±¼", "´Ü°èÀû", "µ¶Æ¯", "¸£", "¸®", "¸¶", "¸¸³­", "¸î", "¸î¸î", "¸ğÀº", "¸ô", "¸ô¶ó", "¸ô¾Æ", "¸ø°¡", "¸øÁö", "¹Ù·Î", "¹Ù·Î¹Ù·Î",
			"¹ÙÀÌ", "¹Ú¾¾", "¹ßÀÌ", "¹àÀº", "¹ã»çÀÌ", "¹øÅ¸ÀÚ", "º£", "º¯ÇÑ", "º¸±â¿£", "ºÎ¼­Áø", "»ç±Í", "»ç¶û½º·±", "¼­ÀÇ", "¼­ÀÖ", "¼®ÀÌ", "¼¼°èÀû", "¼¼¶ó",
			"([-].+)", "¾À", "pan", "sov", "±º", "±Ş", "³î", "´«ÀÌ", "´Ş¸°", "´ëÇü", "·±", "¸¶·Ã", "¸·", "¸Ç", "¸ğ", "¹«Á¶°Ç", "¹Ì", "¹é",
			"ºü¸¥", "»ç", "»çÀÌ", "¼±", "¾ÈÀÇ", "¿£", "¿µ", "¿Â", "¿Ã", "ÀÌ°¡", "ÀÌ³ª", "À¯", "Àü", "Á¶", "Á¸", "Áø", "Âù", "ÃÖ", "Åº", "ÅÂ",
			"ÆÄ", "ÇÑ¹ø", "Çö", "È¸", "0.*", "°¡½º°¡", "°¡½Å", "°¡½Ç", "°¨Àº", "°ª½Ñ", "°­ÀÎÇÑ", "°®°¡Áö", "°ÆÁ¤½º·±", "°ø½ÄÀû", "±¤", "±¸¿Í", "±¸¿î",
			"±¹ÀÌ", "±èº´", "±è´ëÅë·É", "±è¾¾", "³ª±â", "³ª¿µ", "³ªÀ±", "³²", "³²¼÷", "³»¸®", "³»¼­", "³»½Å", "³»Áö", "³Î", "³ë", "³ë´ëÅë·É", "³ë¶õ", "´©",
			"´º", "´Ï", "´ÚÅÍ", "´Ü°èº°", "´ë", "µ¿Ã¶", "µğ", "µğ°Ô", "µû±â", "¶§", "¶óÀÌ", "·¯", "·¹", "·Î", "¸°", "¸¶¶ó", "¸¶À½¼Ó", "¸¶Ä¡", "¸¸±æ",
			"¸¸¸¸", "¸¸¹ß", "¸¸ºÀ", "¸¸¼º", "¸¸¼ö", "¸¸¿©", "¸¸¿ø", "¸¸¿øÂ¥¸®", "¸¼Àº", "¸ÕÀú", "¸í", "¸í¼÷", "¸í½Å", "¸í¾¿", "¸í¼ö", "¸íÀº", "¸íÀÚ",
			"¸ğµÎ", "¸ğÀº", "¸ñÀÌ", "¹¹¾î", "¹ºÁö", "¹ÌÅÍ", "¹Ì¿¬", "¹Ì¿µ", "¹ÌÀÚ", "¹ÌÁ¤", "¹Î°æ", "¹Î°ü", "¹Î±¹", "¹Î±Ô", "¹Î¼®", "¹Î¿ì", "¹ÎÀÌ", "¹ÎÀÚ",
			"¹ÎÁö", "¹ÎÈ£", "¹Ù´å¼Ó", "¹Ù¸£", "¹ÚºÎÀå", "¹ÚºÎÀåÁı", "¹Ú¸ğ", "¹ÚÀÌ", "¹ÚÀÏ", "¹ß¶ö", "¹ß»ı½Ã", "¹æ°úÈÄ", "¹æÀÌ", "ºÀ±¸", "ºÀ¼±", "ºÀ¼ö", "ºÎÀº",
			"ºÎÀÇ", "ºÏÃø", "ºñ·Î", "ºô", "»ç°¡", "»ç´Ù", "»ï¹é", "»ó°ú", "»óÇÏ", "»ı±â±â", "»ı»ı", "¼­", "¼­³Ê", "¼­¾ß", "¼±°¡", "¼±°ú", "¼±¿µ", "¼±¿ì",
			"¼±Àº", "¼±ÀÚ", "¼±Àç", "¼±ÁÖ", "¼±Èñ", "¼ºÀº", "¼ºÈ¯", "¼ºÈ£", "¼¼", "¼¼°¡", "¼¼°è·Î", "¼Ò¹®³­", "¼ÒºñÀÚ°¡", "¼ÒÀÇ", "¼Û", "¼öÁ¤ÀÌ", "¼÷",
			"½ºÆ®", "½½ÇÂ", "½Â", "½Ã°í", "½Ã°£¾¿", "½Ã¸°", "½ÃÀÇ", "½ÄÀÇ", "½Å¾Ö", "½Å¿µ", "½Ì½Ì", "¾À1", "¾À10", "¾À11", "¾À12", "¾À13", "¾À14",
			"¾À15", "¾À16", "¾À17", "¾À18", "¾À19", "¾À2", "¾À20", "¾À21", "¾À22", "¾À23", "¾À24", "¾À25", "¾À26", "¾À27", "¾À28",
			"¾À29", "¾À3", "¾À30", "¾À31", "¾À32", "¾À33", "¾À34", "¾À35", "¾À36", "¾À37", "¾À38", "¾À39", "¾À4", "¾À40", "¾À41",
			"¾À42", "¾À43", "¾À44", "¾À45", "¾À46", "¾À47", "¾À48", "¾À49", "¾À5", "¾À50", "¾À6", "¾À7", "¾À8", "¾À9", "¾Æ", "¾Æ¸§´Ù¿î",
			"¾Æ¸®", "¾Æ¸¶", "¾Æ¹«", "¾Æ¹öÁø", "¾Æºş", "¾Æ¿µ", "¾Ç", "¾ÆÈÄ", "¾ÆÈŞ", "¾Ø", "¾ß", "¾ç±¹°£", "¾ó", "¾÷¹«»ó", "¿¡¼­¿­¸°", "¿ª½Ã", "¿¬³»",
			"¿¾³¯¿£", "¿Àºş", "¿À·¡", "¿ÁºĞ", "¿Ï", "¿Ö", "¿ä", "¿ä°Ç", "¿ëÀÇÀÚ°¡", "¿ì¾¾", "¿ìÇö", "¿ø°æ", "À¯º°³­", "À±", "À±ÁÖ", "À±¹Ì", "À±¾¾", "À±Á¤",
			"À±È£", "À±Èñ", "À¸ÀÌ±×", "Àº°æ", "Àº±Ù", "Àº´Ô", "Àº¼­", "Àº¼ö", "Àº¼÷", "Àº¿µ", "ÀºÀÇ", "ÀºÀÌ", "ÀºÀÚ", "ÀºÁ¤", "ÀºÁÖ", "ÀºÁö", "ÀºÈñ",
			"ÀÌ°í", "ÀÌ°÷", "ÀÌ°÷Àú°÷", "ÀÌ±¸", "ÀÌ±â", "ÀÌ²ø", "ÀÌ³¯", "ÀÌµµ", "ÀÌµé", "ÀÌ¸§³­", "ÀÌ¸¸", "ÀÌ¸é", "ÀÌ¹é", "ÀÌºĞ", "ÀÌ¾¾", "ÀÌ¿Õ", "ÀÌ¿Ü",
			"ÀÎ¿µ", "ÀÎ¿Á", "ÀÎÀÎ", "ÀÚ", "ÀÚ°æ", "ÀÚ¶û½º·±", "Àç¹Ì³­", "Á¢", "Á¦", "Á·", "ÁØÇÏ", "ÁØÇõ", "ÁØÈ£", "ÁØÈñ", "ÁØ¼­", "ÁØ¼ö", "ÁØ¿µ", "Áï½Ã",
			"Áõ", "Áõ¸»", "Áö°¡", "ÁöµµºÎ°¡", "Áø¾¾", "ÁøÀÌ", "ÁøÁö", "ÁøÇÑ", "Â£Àº", "ÂªÀº", "Â÷°¡¿î", "Ã¬", "Ã·", "Ã»", "Ãâ¿¬ÀÚ°¡", "Ä£±¸µéÀÌ¶û", "ÄÑ",
			"ÅÂ¿õ", "ÅÂÁØ", "ÅÂÈ£", "ÅÂÈ¯", "ÅÂÈÆ", "ÅÂÈñ", "Å×", "Åä", "Åõ", "Æ®ÀÎ", "ÆÄ¶õ", "ÆÄÀÎ", "ÇÏ¿µ", "ÇÏ¿À", "ÇÏ³ª¾¿", "ÇÏ´Ï", "ÇÏÀÌ", "ÇÑµ¿¾È",
			"ÇÑ¾¾", "ÇÑÀåÀÌ", "ÇÑÂ÷·Ê", "ÇÑÅ×", "ÇÔ²²", "ÇÔ¿¡", "ÇÔÀÌ", "ÇÔÀÇ", "ÇÖ", "Çã", "Çö¾Æ", "Çö¿ì", "Çö¿í", "ÇöÁÖ", "ÇöÈñ", "Ç÷Áß", "Çı°æ", "Çı¸®",
			"Çı¼º", "Çı¼÷", "Çı¿ø", "ÇıÁø", "È£", "È£±â", "È«", "È­³­", "È²¾¾", "ÈÄº¸ÀÚ°¡", "Èê·¯", "Çß", "has", "have", "was", "were", "is",
			"am", "are", "@" };

	static {
		final List<String> stopWords = Arrays.asList("a", "about", "above", "after", "again", "against", "all", "am",
				"an", "and", "any", "are", "aren't", "aren", "as", "at", "be", "because", "been", "before", "being",
				"below", "between", "both", "but", "by", "can't", "cannot", "could", "couldn't", "couldn", "did",
				"didn't", "didn", "do", "does", "doesn't", "doesn", "doing", "don't", "don", "down", "during", "each",
				"few", "for", "from", "further", "had", "hadn't", "hadn", "has", "hasn't", "hasn", "have", "haven't",
				"haven", "having", "he", "he'd", "he'll", "he's", "her", "here", "here's", "hers", "herself", "him",
				"himself", "his", "how", "how's", "i", "i'd", "i'll", "i'm", "i've", "if", "in", "into", "is", "isn't",
				"isn", "it", "it's", "its", "itself", "let's", "let", "me", "more", "most", "mustn't", "mustn", "my",
				"myself", "no", "nor", "not", "of", "off", "on", "once", "only", "or", "other", "ought", "our",
				"ours ", "ourselves", "out", "over", "own", "same", "shan't", "shan", "she", "she'd", "she'll",
				"she's", "should", "shouldn't", "shouldn", "so", "some", "such", "than", "that", "that's", "the",
				"their", "theirs", "them", "themselves", "then", "there", "there's", "these", "they", "they'd",
				"they'll", "they're", "they've", "this", "those", "through", "to", "too", "under", "until", "up",
				"very", "was", "wasn't", "we", "we'd", "we'll", "we're", "we've", "were", "weren't", "weren", "what",
				"what's", "when", "when's", "where", "where's", "which", "while", "who", "who's", "whom", "why",
				"why's", "with", "won't", "won", "would", "wouldn't", "wouldn", "you", "you'd", "you'll", "you're",
				"you've", "your", "yours", "yourself", "yourselves");

		final Set<String> stopSet = new HashSet<String>();

		stopSet.addAll(stopWords);

		ENGSTOP_SET = Collections.unmodifiableSet(stopSet);
	}

	/** ºÒ¿ë¾î ÃßÃâ ÀÌÀ¯ */
	private static String reason;

	/**
	 * ÆĞÅÏ¿¡ ÀÇÇÑ ºÒ¿ë¾î¸¦ Ã¼Å© ÇÔ
	 * 
	 * @see com.saltlux.tms3.util.UserStopWordPattern#isPatternStopWord(java.lang.String)
	 */
	@Override
	public boolean isPatternStopWord(String term) {
		return isStopWord(term);
	}

	/**
	 * Pattern ±â¹İÀÇ ºÒ¿ë¾î ÃßÃâ<br/>
	 */
	public static boolean isStopWord(final String Term) {
		// 0. ºñ¾úÀ» ¶§
		if (Term == null || Term.length() == 0) {
			reason = "\t 0. ºñ¾úÀ» ¶§";
			return true;
		}

		// 1. 45ÀÚº¸´Ù ±æ¶§
		if (Term.length() >= 45) {
			reason = "\t 1. 45ÀÚº¸´Ù ±æ¶§";
			return true;
		}

		// 2. ¿µ¹® ºÒ¿ë¾î
		if (ENGSTOP_SET.contains(Term)) {
			reason = "\t 2. ¿µ¹® ºÒ¿ë¾î";
			return true;
		}

		// 3. ÇÑ±ÛÀÚ ´Ü¾î
		if (Term.length() == 1 || Term.matches("^[¤¡-¤¾¤¿-¤Ó°¡-ÆR]$")) {
			reason = "\t 3. ÇÑ±ÛÀÚ ´Ü¾î";
			return true;
		}

		Pattern ptn = Pattern.compile("-?\\d+([.,~]\\d+)?", Pattern.MULTILINE);

		Matcher matcher = ptn.matcher(Term);

		// 4. ¼ıÀÚ·Î¸¸ ±¸¼ºµÈ ´Ü¾î (¼ıÀÚ . - )
		if (matcher.find()) {
			reason = "\t 4. ¼ıÀÚ·Î¸¸ ±¸¼ºµÈ ´Ü¾î (¼ıÀÚ . - )";
			return true;
		}

		ptn = Pattern.compile(".*[^¤¡-¤¾¤¿-¤Ó°¡-ÆR|a-z|A-Z]$", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 5. ±ÛÀÚ°¡ ¾Æ´Ñ ±âÈ£·Î ³¡³­ ´Ü¾î
		if (matcher.find()) {
			reason = "\t 5. ±ÛÀÚ°¡ ¾Æ´Ñ ±âÈ£·Î ³¡³­ ´Ü¾î";
			return true;
		}

		ptn = Pattern.compile("^[^¤¡-¤¾¤¿-¤Ó°¡-ÆR|a-z|A-Z|0-9]+$", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 6. ±âÈ£·Î¸¸ ±¸¼ºµÈ ´Ü¾î
		if (matcher.find()) {
			reason = "\t 5. ±ÛÀÚ°¡ ¾Æ´Ñ ±âÈ£·Î ³¡³­ ´Ü¾î";
			return true;
		}

		ptn = Pattern.compile("-?\\d+(\\.\\d+)?\\D+", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 7. ¼ıÀÚ + ÀÇÁ¸¸í»ç
		if (matcher.find()) {
			reason = "\t 7. ¼ıÀÚ + ÀÇÁ¸¸í»ç";
			return true;
		}

		ptn = Pattern.compile("[\\D]_.*[\\D]", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// // 8. ÇÑ±ÛÀÚ_¿©·¯±ÛÀÚ
		// if (matcher.find()) {
		// return "\t 8. ÇÑ±ÛÀÚ_¿©·¯±ÛÀÚ";
		// }

		ptn = Pattern.compile("\\d+[\\D]_.*[\\D]]", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 9. ¼ıÀÚ+±ÛÀÚ_±ÛÀÚ
		if (matcher.find()) {
			reason = "\t 9. ¼ıÀÚ+±ÛÀÚ_±ÛÀÚ";
			return true;
		}

		ptn = Pattern.compile("-?\\d+([.,~]?\\d+)[_\\-=]\\w+", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 10. ¼ıÀÚ+±âÈ£+±ÛÀÚ
		if (matcher.find()) {
			reason = "\t 10. ¼ıÀÚ+±âÈ£+±ÛÀÚ";
			return true;
		}

		ptn = Pattern.compile("-?\\d+([.,~]?\\d+)\\W+", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 11. 3~4ÁÖ
		if (matcher.find()) {
			reason = "\t 11. 3~4ÁÖ";
			return true;
		}

		ptn = Pattern.compile("^[¤¡-¤¾¤¿-¤Ó°¡-ÆR]+[^¤¡-¤¾¤¿-¤Ó°¡-ÆR _]+[¤¡-¤¾¤¿-¤Ó°¡-ÆR]+$", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 12. ÇÑ±Û ½ÃÀÛ°ú ³¡ »çÀÌ¿¡ ÇÑ±ÛÀ» Á¦¿ÜÇÑ ±ÛÀÚ°¡ µé¾î°£ °æ¿ì
		if (matcher.find()) {
			reason = "\t 12. ÇÑ±Û ½ÃÀÛ°ú ³¡ »çÀÌ¿¡ ÇÑ±ÛÀ» Á¦¿ÜÇÑ ±ÛÀÚ°¡ µé¾î°£ °æ¿ì";
			return true;
		}

		ptn = Pattern.compile("^[^a-zA-Z¤¡-¤¾¤¿-¤Ó°¡-ÆR]+", Pattern.MULTILINE);
		matcher = ptn.matcher(Term);

		// 13. ¿µÇÑÀ¸·Î ½ÃÀÛµÇÁö ¾Ê´Â °æ¿ì
		if (matcher.find()) {
			reason = "\t 13. ¿µÇÑÀ¸·Î ½ÃÀÛµÇÁö ¾Ê´Â °æ¿ì";
			return true;
		}

		// 14. stopcontain : ÀÏÄ¡ÇÏ¸é
		for (int i = 0; i < stopContain.length; i++) {
			ptn = Pattern.compile(stopContain[i], Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			// 14. stopcontain : ÀÏÄ¡ÇÏ¸é
			if (matcher.find()) {
				reason = "\t 14. stopcontain : ÀÏÄ¡ÇÏ¸é(" + stopContain[i] + ")";
				return true;
			}
		}

		// 15. stoppattern : ÆĞÅÏÀÌ ÀÏÄ¡ÇÏ¸é
		for (int i = 0; i < stopPattern.length; i++) {
			ptn = Pattern.compile(stopPattern[i], Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			// 15. stoppattern : ÆĞÅÏÀÌ ÀÏÄ¡ÇÏ¸é
			if (matcher.find()) {
				reason = "\t 15. stoppattern : ÆĞÅÏÀÌ ÀÏÄ¡ÇÏ¸é(" + stopPattern[i] + ")";
				return true;
			}
		}

		// 16. stoppostfix : ³¡³ª´Â ÆĞÅÏ
		for (String s : stopPostfix) {
			ptn = Pattern.compile(s + "$", Pattern.MULTILINE);
			matcher = ptn.matcher(Term);
			if (matcher.find()) {
				reason = "\t 16. stoppostfix : ³¡³ª´Â ÆĞÅÏ(" + s + ")";
				return true;
			}
		}

		// 17. stopsegment : Áß°£ Æ÷ÇÔ´Ü¾î
		for (int i = 0; i < stopSegment.length; i++) {
			ptn = Pattern.compile("^" + stopSegment[i] + "$", Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			if (matcher.find()) {
				reason = "\t 17. stopsegment : Áß°£ Æ÷ÇÔ´Ü¾î ^XXX$(" + stopSegment[i] + ")";
				return true;
			}

			ptn = Pattern.compile("^" + stopSegment[i] + "_", Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			if (matcher.find()) {
				reason = "\t 17. stopsegment : Áß°£ Æ÷ÇÔ´Ü¾î ^XXX_(" + stopSegment[i] + ")";
				return true;
			}

			ptn = Pattern.compile("_" + stopSegment[i] + "$", Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			if (matcher.find()) {
				reason = "\t 17. stopsegment : Áß°£ Æ÷ÇÔ´Ü¾î _XXX$(" + stopSegment[i] + ")";
				return true;
			}

			ptn = Pattern.compile("_" + stopSegment[i] + "_", Pattern.MULTILINE);
			matcher = ptn.matcher(Term);

			if (matcher.find()) {
				reason = "\t 17. stopsegment : Áß°£ Æ÷ÇÔ´Ü¾î _XXX_(" + stopSegment[i] + ")";
				return true;
			}
		}

		// 18. stopPrefix : ½ÃÀÛ ÆĞÅÏ
		for (String s : stopPrefix) {
			ptn = Pattern.compile("^" + s, Pattern.MULTILINE);
			matcher = ptn.matcher(Term);
			if (matcher.find()) {
				reason = "\t 18. stopPrefix : ½ÃÀÛ ÆĞÅÏ(" + s + ")";
				return true;
			}
		}
		return false;
	}

	/**
	 * @return the reason
	 */
	public static String getReason() {
		return reason;
	}

}